In [1]:
import pandas as pd

1 - Aplique as quatro formas de join estudadas nos seguintes dataframes:

In [16]:
df1 = pd.DataFrame({'A': [4,2,1,3], 'B': ['a','b','c','b']})
df2 = pd.DataFrame({'A': [2,3,5], 'C': [10,20,30]})

In [17]:
df1

   A  B
0  4  a
1  2  b
2  1  c
3  3  b

In [18]:
df2

   A   C
0  2  10
1  3  20
2  5  30

In [19]:
df1.merge(df2, on= ['A'], how= 'left')

   A  B     C
0  4  a   NaN
1  2  b  10.0
2  1  c   NaN
3  3  b  20.0

In [20]:
df1.merge(df2, on=['A'], how='inner')

   A  B   C
0  2  b  10
1  3  b  20

In [21]:
df1.merge(df2, on='A', how='right')

   A    B   C
0  2    b  10
1  3    b  20
2  5  NaN  30

In [22]:
df1.merge(df2, on='A', how='outer')

   A    B     C
0  4    a   NaN
1  2    b  10.0
2  1    c   NaN
3  3    b  20.0
4  5  NaN  30.0

2 - Sobre o resultado do outer join anterior, ordene a saída pela coluna A (ajustar índices).

In [25]:
resultado = df1.merge(df2, on='A', how='outer')

In [29]:
resultado = resultado.sort_values('A').reset_index(drop=True)
resultado

   A    B     C
0  1    c   NaN
1  2    b  10.0
2  3    b  20.0
3  4    a   NaN
4  5  NaN  30.0

3 - Concatenar df1 e df2 em formato de linhas e depois colunas (ajustar índices).

In [30]:
pd.concat([df1, df2], ignore_index = True)

   A    B     C
0  4    a   NaN
1  2    b   NaN
2  1    c   NaN
3  3    b   NaN
4  2  NaN  10.0
5  3  NaN  20.0
6  5  NaN  30.0

In [31]:
pd.concat([df1, df2], axis = 1)

   A  B    A     C
0  4  a  2.0  10.0
1  2  b  3.0  20.0
2  1  c  5.0  30.0
3  3  b  NaN   NaN

4 - Calcule a soma da coluna A por agrupamento da coluna B no df1.

In [32]:
df3 = (df1 + df2)